gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
int alarmStateRelais    = 0; // actual state of alarm derived from relais
int alarmStateRelaisOld = 0; // previous value of alarmStateRelais
int alarmStateLevel     = 0; // actual state of alarm derived from measured water level
int alarmStateLevelOld  = 0; // previous value of alarmStateLevel
int alarmState    = 0;       // worst case value of both alarmState
                             //   5 : pump running
                             //   4 : severe warning
                             //   3 : normal high
                             //   2 : normal 
                             //   1 : normal low
int alarmStateOld = 0;       // previous value of alarmState
bool executeSendMail = false;

int debugLevelSwitches_old = 0;
String receivedString="";

char input[64];
bool inputReadingCompleted = false;

long lastMillis=0;


int doPrint = 0;
int value = 0;



//* ============================================================= */
/* Definition for Send-Mail                                      */

/* settings for GMAIL */
#define SMTP_HOST "smtp.gmail.com"
#define SMTP_PORT esp_mail_smtp_port_587 // port 465 is not available for Outlook.com

/* The log in credentials */
#define AUTHOR_NAME "Pegelstand Zehentner"
#define AUTHOR_EMAIL "georgzehentneresp@gmail.com"
#define AUTHOR_PASSWORD "lwecoyvlkmordnly"

/* Recipient email address */
#if isLiveSystem == 1
  #define RECIPIENT_EMAIL "gzehentner@web.de"
#else
  #define RECIPIENT_EMAIL "gzehentner@t-online.de"
#endif

/* Declare the global used SMTPSession object for SMTP transport */
SMTPSession smtp;

Session_Config config;

/* Callback function to get the Email sending status */
void smtpCallback(SMTP_Status status);

#include "HeapStat.h"
HeapStat heapInfo;

// GZE: I dont know what this par of code does
extern char _end;
#if BOARDTYPE == ESP8266
  extern "C" char *sbrk(int i);
#endif

char *ramstart = (char *)0x20070000;
char *ramend = (char *)0x20088000;

// const char rootCACert[] PROGMEM = "-----BEGIN CERTIFICATE-----\n"
//                                   "-----END CERTIFICATE-----\n";
/* END Definition for Send-Mail                                      */
/* ============================================================= */

/* *******************************************************************
         other settings / weitere Einstellungen für den Anwender
 ********************************************************************/

#ifndef STASSID                // either use an external .h file containing STASSID and STAPSK or ...
#define STASSID "Zehentner"    // ... modify these line to your SSID
#define STAPSK "ElisabethScho" // ... and set your WIFI password
#endif

const char *ssid = STASSID;
const char *password = STAPSK;


WiFiUDP ntpUDP;

#ifndef CSS_MAINCOLOR
#define CSS_MAINCOLOR "#8A0829" // fallback if no CSS_MAINCOLOR was declared for the board
#endif


/*=================================================================*/
/*  Prepare analog out        */
/*=================================================================*/

//--------------- fading LED not used for simulation
//
// fade LED PIN (replace with LED_BUILTIN constant for built-in LED)
// #define LED_PIN            builtin_led

// float dutycylce  = 0;              // how bright the LED is

// float fadeAmount = 0.0001;         // how many m to fade the LED by

//--------------------------------------------------------------------

unsigned long previousMillisCyclicPrint;
unsigned long WaitingTimeCyclicPrint = 1000;

unsigned long previousMillis_halfSecondAction;
unsigned long halfSecond;


 void flushInput(){
  for (int i = 0; i < 64; i++){
    input[i] = {};
  }
 }
/*****************************************************************************************************************
 *****************************************************************************************************************
         S E T U P
 *****************************************************************************************************************
 *****************************************************************************************************************/

void setup(void) {

  #if BOARDTYPE == ESP32
     WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // disable brownout detector
  #endif 

  pinMode(builtin_led, OUTPUT);

  /*=================================================================*/
  /* =================  setup serial     */
  Serial.begin(115200);
  
  // wait for serial to come online
  while(!Serial); 
  Serial.println("Serial is ready to accept input");
  //------------------------

  Serial.println(F("\n" TXT_BOARDNAME "\nVersion: " VERSION " Board " TXT_BOARDID " "));
  Serial.print(__DATE__);
  Serial.print(F(" "));
  Serial.println(__TIME__);

   /*=================  Connect to WIFI */
  char myhostname[8] = {"esp"};
  strcat(myhostname, TXT_BOARDID);
  WiFi.hostname(myhostname);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }

  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  #if BOARDTYPE == ESP32

    if (MDNS.begin("esp32")) {
      Serial.println("MDNS responder started");
    }
    #else
    
    if (MDNS.begin("esp8266")) {
      Serial.println(F("MDNS responder started"));
      }
    #endif
  /*=================================================================*/
  /*====================   Prepare SendMail */

  MailClient.networkReconnect(true);
  smtp.debug(0);

  smtp.callback(smtpCallback);

  config.server.host_name = SMTP_HOST;
  config.server.port = SMTP_PORT;
  config.login.email = AUTHOR_EMAIL;
  config.login.password = AUTHOR_PASSWORD;

  config.login.user_domain = F("127.0.0.1");

  /*=================================================================*/
  /*====================   Prepare connection to timeserver */

  #if BOARDTYPE == ESP32
    // ESP32 
    configTime(0, 0, MY_NTP_SERVER);  // 0, 0 because we will use TZ in the next line
    setenv("TZ", MY_TZ, 1);            // Set environment variable with your time zone
    tzset();
  #else
    // ESP8266
    configTime(MY_TZ, MY_NTP_SERVER);    // --> for the ESP8266 only
  #endif


